Repository: python/pootle-python-org-backup
Catalog: tmxes/ru/reference.tmx
Source language: en
Languages: ru

source: Note that the comprehension is executed in a separate scope, so names assigned to in the target list don't "leak" in the enclosing scope.
ru: Заметьте, что “компоновки” исполняются в отдельной области имён, поэтому имена, которым были назначения в списке приёмников, не “просачиваются” во внешнюю область.

source: A list display is a possibly empty series of expressions enclosed in square brackets:
ru: Отображение списка – это последовательность выражений (может быть пустая), заключённая в квадратные скобки :

source: A list display yields a new list object, the contents being specified by either a list of expressions or a comprehension. When a comma-separated list of expressions is supplied, its elements are evaluated from left to right and placed into the list object in that order. When a comprehension is supplied, the list is constructed from the elements resulting from the comprehension.
ru: Запись списка даёт в результате объект-список, содержание которого определено или перечислением выражений, или конструкцией генерации (компонования) списка (“comprehension”) . В первом варианте, когда дан список выражений, разделённых запятой – его элементы интерпретируются слева направо – и помещаются в объект-список в том же порядке. Во втором варианте, когда дана конструкция компоновки списка – список составляется из элементов, генерируемых этой конструкцией.

source: A set display is denoted by curly braces and distinguishable from dictionary displays by the lack of colons separating keys and values:
ru: Запись множества обозначается фигурными скобками, и признаком, отличающим его от словаря, является отсутствие двоеточий – разделителей ключей и значений :

source: A set display yields a new mutable set object, the contents being specified by either a sequence of expressions or a comprehension. When a comma-separated list of expressions is supplied, its elements are evaluated from left to right and added to the set object. When a comprehension is supplied, the set is constructed from the elements resulting from the comprehension.
ru: Запись множества даёт в результате изменяемый объект-множество, содержание которого определено или перечислением выражений, или конструкцией генерации (компонования) списков (“comprehension”) . В первом варианте, когда дан список выражений, разделённых запятой – его элементы интерпретируются слева направо – и добавляются к объекту-множеству. Во втором варианте, когда дана конструкция компоновки списков – множество составляется из элементов, генерируемых этой конструкцией.

source: An empty set cannot be constructed with ``{}``; this literal constructs an empty dictionary.
ru: Пустое множество не может быть создано с помощью обозначения «``{}``» – эта запись создаёт пустой словарь.

source: A dictionary display is a possibly empty series of key/datum pairs enclosed in curly braces:
ru: Запись словаря – это последовательность (может быть пустая) пар ключ – данные, заключённая в фигурные скобки :

source: A dictionary display yields a new dictionary object.
ru: Запись словаря даёт в результате новый объект-словарь.

source: If a comma-separated sequence of key/datum pairs is given, they are evaluated from left to right to define the entries of the dictionary: each key object is used as a key into the dictionary to store the corresponding datum. This means that you can specify the same key multiple times in the key/datum list, and the final dictionary's value for that key will be the last one given.
ru: Если дана последовательность разделённых запятой пар : ключ - данные, то они интерпретируются с лева направо и множество всех ключей образуют множество имён элементов словаря, а соответствующие им данные становятся значениями этих элементов. При этом : если тот же ключ встречается в этой последовательности несколько раз, то только последнее значение, соответствующее ему, окажется в словаре-результате.

source: A dict comprehension, in contrast to list and set comprehensions, needs two expressions separated with a colon followed by the usual "for" and "if" clauses. When the comprehension is run, the resulting key and value elements are inserted in the new dictionary in the order they are produced.
ru: В конструкции сборки (генерации) словаря, в отличие от таковых для списков и множеств, должно присутствовать два выражения, разделённых двоеточием, за которыми следуют обычные конструкции «:keyword:`for`» и «:keyword:`if`» . При исполнении сборки каждая пара значений в качестве соответственно ключа и его значения вставляется в словарь в порядке генерации.

source: Restrictions on the types of the key values are listed earlier in section :ref:`types`. (To summarize, the key type should be :term:`hashable`, which excludes all mutable objects.) Clashes between duplicate keys are not detected; the last datum (textually rightmost in the display) stored for a given key value prevails.
ru: Ограничения того, каким типам могут принадлежать ключи (а не сопоставленные им объекты) – перечислены выше, в разделе “Иерархия стандартных типов” :ref:`types` . (Коротко : ключ должен быть хешируемого (:term:`hashable`) типа, что сразу исключает любые изменяемые типы. ) Коллизии между одинаковыми ключами не детектируются – просто последнее значение (самое правое, по тексту) , сохранённое под данным ключом, заменяет предыдущие значения.

source: Generator expressions
ru: Генераторные выражения

source: A generator expression is a compact generator notation in parentheses:
ru: Генераторное выражение – это компактная форма записи генераторов в скобках :

source: A generator expression yields a new generator object. Its syntax is the same as for comprehensions, except that it is enclosed in parentheses instead of brackets or curly braces.
ru: Генераторное выражение даёт в результате новый объект-генератор. Синтаксис у этого выражения такой же, как и у генератора списка, за исключением того, что оно заключено в круглые скобки вместо квадратных или фигурных.

source: Variables used in the generator expression are evaluated lazily when the :meth:`__next__` method is called for generator object (in the same fashion as normal generators). However, the leftmost :keyword:`for` clause is immediately evaluated, so that an error produced by it can be seen before any other possible error in the code that handles the generator expression. Subsequent :keyword:`for` clauses cannot be evaluated immediately since they may depend on the previous :keyword:`for` loop. For example: ``(x*y for x in range(10) for y in bar(x))``.
ru: Переменные, используемые в генераторных выражениях, вычисляются отложенно, во время вызова метода «:meth:`__next__`» у объекта-генератора (так же, как и для обычных генераторов) . Однако, самое левое выражение «:keyword:`for`» вычисляется сразу же – поэтому ошибка в нём проявится раньше, чем в других частях кода, контролируемых данным генераторным выражением. Следующие (в том же генераторном выражении) «:keyword:`for`» – не могут интерпретироваться сразу же, поскольку они могут зависеть от «:keyword:`for`» слева. (Например : «``(x*y for x in range(10) for y in bar(x))``» . )

source: The parentheses can be omitted on calls with only one argument. See section :ref:`calls` for the detail.
ru: Скобки можно пропустить при вызове функции, у которой один аргумент. (Смотрите раздел :ref:`calls` )

source: The :keyword:`yield` expression is only used when defining a generator function, and can only be used in the body of a function definition. Using a :keyword:`yield` expression in a function definition is sufficient to cause that definition to create a generator function instead of a normal function.
ru: Ключевое слово «:keyword:`yield`» используется только для задания генераторной функции и может использоваться только внутри определения функции. Чтобы превратить определение обычной функции в определение генераторной – достаточно использовать в этом определении инструкцию «:keyword:`yield`» .

source: All of this makes generator functions quite similar to coroutines; they yield multiple times, they have more than one entry point and their execution can be suspended. The only difference is that a generator function cannot control where should the execution continue after it yields; the control is always transfered to the generator's caller.
ru: Всё это делает генераторные функции похожими на со-процедуры (“coroutines”) : они выдают результат многократно, у них более одной точки входа и их исполнение может быть приостановлено. Единственное отличие в том, что генераторная функция не может управлять тем, что должно исполняться, после того, как она приостанавливается – контроль всегда возвращается туда, откуда этот генератор был вызван.

source: The :keyword:`yield` statement is allowed in the :keyword:`try` clause of a :keyword:`try` ... :keyword:`finally` construct. If the generator is not resumed before it is finalized (by reaching a zero reference count or by being garbage collected), the generator-iterator's :meth:`close` method will be called, allowing any pending :keyword:`finally` clauses to execute.
ru: Инструкция «:keyword:`yield`» допустима в ветви «:keyword:`try`» конструкции «:keyword:`try` ... :keyword:`finally`» . Если данный генератор не был завершён до его “деструкции” (вследствие достижения ноля счётчиком ссылок или действием “сборщика мусора”) , то будет вызван метод «:meth:`close`» данного генератора, что позволяет исполниться незавершённым ветвям «:keyword:`finally`» .

source: The following generator's methods can be used to control the execution of a generator function:
ru: Генераторная функция для управления её исполнением имеет следующие методы :

source: Starts the execution of a generator function or resumes it at the last executed :keyword:`yield` expression. When a generator function is resumed with a :meth:`__next__` method, the current :keyword:`yield` expression always evaluates to :const:`None`. The execution then continues to the next :keyword:`yield` expression, where the generator is suspended again, and the value of the :token:`expression_list` is returned to :meth:`next`'s caller. If the generator exits without yielding another value, a :exc:`StopIteration` exception is raised.
ru: Начинает исполнение генераторной функции или продолжает его с последней исполненной инструкции «:keyword:`yield`» . Если в результате вызова метода «:meth:`__next__`» генераторная функция продолжает работу, которая была приостановлена вызовом функции «:keyword:`yield`» , то эта «:keyword:`yield`» завершается, выдавая результат «:const:`None`» . Затем исполнение генератора продолжается до следующей инструкции «:keyword:`yield`» , где оно опять приостанавливается, а значение выражения-аргумента инструкции «:keyword:`yield`» возвращается в место вызова функции «:meth:`next`» . Если происходит выход из генератора не по инструкции «:keyword:`yield`» , то вызывается исключение «:exc:`StopIteration`» .

source: This method is normally called implicitly, e.g. by a :keyword:`for` loop, or by the built-in :func:`next` function.
ru: В норме этот метод не вызывается прямо, а, например, косвенно циклом «:keyword:`for`» или встроенной функцией «:func:`next`» .

source: Resumes the execution and "sends" a value into the generator function. The ``value`` argument becomes the result of the current :keyword:`yield` expression. The :meth:`send` method returns the next value yielded by the generator, or raises :exc:`StopIteration` if the generator exits without yielding another value. When :meth:`send` is called to start the generator, it must be called with :const:`None` as the argument, because there is no :keyword:`yield` expression that could receive the value.
ru: Продолжает исполнение генераторной функции от последней исполненной инструкции «:keyword:`yield`» , которая теперь наконец завершается, выдавая в качестве своего результата аргумент ``value`` функции «:meth:`send`» . Затем исполнение генератора продолжается до следующей инструкции «:keyword:`yield`» , где оно опять приостанавливается, а значение выражения-аргумента инструкции «:keyword:`yield`» возвращается в место вызова функции «:meth:`send`» . Если происходит выход из генератора не по инструкции «:keyword:`yield`» , то вызывается исключение «:exc:`StopIteration`» (и возврат в «:meth:`send`» не происходит) . Если функция «:meth:`send`» вызывается для генератора, который ещё не был запущен и приостановлен посредством «:keyword:`yield`» , то она должна вызывается только с аргументом «:const:`None`» (потому, что нет функции «:keyword:`yield`» , ожидающей значение) .

source: Raises an exception of type ``type`` at the point where generator was paused, and returns the next value yielded by the generator function. If the generator exits without yielding another value, a :exc:`StopIteration` exception is raised. If the generator function does not catch the passed-in exception, or raises a different exception, then that exception propagates to the caller.
ru: Приводит к исключению типа «``type``» в том месте генератора, где он был остановлен. Если генератор перехватывает это исключение, то : или функция «:func:`throw`» возвращает следующее значение, выданное генератором, или, если генератор завершается без инструкции «:keyword:`yield`» , то вызывается исключение «:exc:`StopIteration`» . Если же генератор не перехватывает переданное ему исключение, или генерирует какое-либо исключение сам, то происходит возврат к функции «:func:`throw`» с этим исключением.

source: Here is a simple example that demonstrates the behavior of generators and generator functions::
ru: Простой пример, демонстрирующий поведение объектов-генераторов и генераторных функций :

source: The proposal for adding generators and the :keyword:`yield` statement to Python.
ru: Предложение по добавлению в Питон генераторов и инструкции «:keyword:`yield`» .

source: The proposal to enhance the API and syntax of generators, making them usable as simple coroutines.
ru: Предложение по улучшению API и синтаксиса генераторов, делающему их пригодными для простейшего параллельного программирования.

source: Primaries
ru: Первичные выражения

source: Primaries represent the most tightly bound operations of the language. Their syntax is:
ru: Первичные выражения – это базовые понятия, операции языка, такие как : взятие атрибута, взятие элемента(элементов) по индексу, вызов функции. У них следующий синтаксис :

source: Attribute references
ru: Обращение к атрибутам

source: An attribute reference is a primary followed by a period and a name:
ru: Обращение к атрибуту состоит из другого первичного выражения (в том числе атома) после которого идёт точка и пото́м имя (атрибута) .

source: The primary must evaluate to an object of a type that supports attribute references, which most objects do. This object is then asked to produce the attribute whose name is the identifier (which can be customized by overriding the :meth:`__getattr__` method). If this attribute is not available, the exception :exc:`AttributeError` is raised. Otherwise, the type and value of the object produced is determined by the object. Multiple evaluations of the same attribute reference may yield different objects.
ru: Значением выражения «``primary``» должен быть объект, тип которого поддерживает обращение к атрибутам (таких типов – большинство) . К этим объектам делается запрос выдать атрибут с указанным именем («``identifier``») . Этот процесс может быть настроен переопределением метода «:meth:`__getattr__`» . Тип и значение возвращаемого атрибута задаётся объектом, которому тот принадлежит, причём каждое обращение к атрибуту может выдавать уже́ новый объект. Если этот атрибут недоступен, то вызывается исключение «:exc:`AttributeError`» .

source: Subscriptions
ru: Обращение к элементу по индексу

source: A subscription selects an item of a sequence (string, tuple or list) or mapping (dictionary) object:
ru: Взятие по индексу выделяет определённый элемент из последовательности (например, из строки, кортежа, списка) или из словаря :

source: The primary must evaluate to an object that supports subscription, e.g. a list or dictionary. User-defined objects can support subscription by defining a :meth:`__getitem__` method.
ru: Значением выражения «``primary``» должен быть объект, тип которого поддерживает взятие элемента по индексу. Определённые пользователем объекты тоже могут поддерживать взятие элемента – определив метод «:meth:`__getitem__`» .

source: For built-in objects, there are two types of objects that support subscription:
ru: Есть два типа встроенных объектов, поддерживающих взятие элемента по индексу :

source: If the primary is a mapping, the expression list must evaluate to an object whose value is one of the keys of the mapping, and the subscription selects the value in the mapping that corresponds to that key. (The expression list is a tuple except if it has exactly one item.)
ru: Если «``primary``» является отображением (словарём) , то значением «``expression_list``» должен быть объект, являющийся одним из ключей данного отображения, и тогда извлекается значение, соответствующее данному ключу. «``expression_list``» является кортежем, если только в списке не ровно одно выражение.

source: If the primary is a sequence, the expression (list) must evaluate to an integer. If this value is negative, the length of the sequence is added to it (so that, e.g., ``x[-1]`` selects the last item of ``x``.) The resulting value must be a nonnegative integer less than the number of items in the sequence, and the subscription selects the item whose index is that value (counting from zero).
ru: Если «``primary``» является последовательностью, то значением «``expression_list``» должно быть целое число. Если это число негативное, то к нему прибавляется длина последовательности (таким образом, «``x[-1]``» указывает на последний элемент в «``x``» ) . Результирующее значение должно быть неотрицательным целым меньшим длины данной последовательности. И в качестве результата извлекается элемент, чьим индексом является это значение (учитывая, что элементы номеруются с ноля) .

source: A string's items are characters. A character is not a separate data type but a string of exactly one character.
ru: Элементами текстовых данных (“строк”) являются символы. Причём символ является не отдельным типом данных, а такою же строкой, но только из одного символа.

source: Slicings
ru: “Срезы”

source: A slicing selects a range of items in a sequence object (e.g., a string, tuple or list). Slicings may be used as expressions or as targets in assignment or :keyword:`del` statements. The syntax for a slicing:
ru: Срез выделяет диапазон элементов в объекте-последовательности (например в строке, в кортеже) . Срезы могут использоваться и как выражения (дающие в результате значение) и как цель для назначения или инструкции «:keyword:`del`» . Синтаксис следующий :

source: There is ambiguity in the formal syntax here: anything that looks like an expression list also looks like a slice list, so any subscription can be interpreted as a slicing. Rather than further complicating the syntax, this is disambiguated by defining that in this case the interpretation as a subscription takes priority over the interpretation as a slicing (this is the case if the slice list contains no proper slice).
ru: В этом формальном синтаксисе есть неоднозначность : что-либо, выглядящее как список выражений – одновременно выглядит как список срезов. Из-за этого любое взятие по индексу может быть интерпретировано как срез. Вместо дополнительного усложнения синтаксиса – двусмысленность снята тем, что в такой ситуации интерпретирование как взятие по индексу приоритетнее, чем как срез (именно это и происходит если в списке среза нет правильного среза) .

source: Calls
ru: Вызовы

source: A call calls a callable object (e.g., a function) with a possibly empty series of arguments:
ru: При вызове вызывается (исполняется) вызываемый (исполнимый) объект (например функция) , которому передаётся список параметров (может быть пустым) :

source: A trailing comma may be present after the positional and keyword arguments but does not affect the semantics.
ru: После позиционных и именованных аргументов может стоять конечная (лишняя) запятая – она не имеет никакого значения и на смысл не влияет.

source: The primary must evaluate to a callable object (user-defined functions, built-in functions, methods of built-in objects, class objects, methods of class instances, and all objects having a :meth:`__call__` method are callable). All argument expressions are evaluated before the call is attempted. Please refer to section :ref:`function` for the syntax of formal parameter lists.
ru: Значением «``primary``» должен быть вызываемый объект (определяемая пользователем или встроенная функция, метод встроенного объекта, объект-класс, метод экземпляра класса или любой объект с методом «:meth:`__call__`» ) . Все выражения-аргументы вычисляются прежде, чем делается попытка вызова. Синтаксис списка “формальных” параметров в определении функции смотрите в разделе «Функции» :ref:`function` .

source: If keyword arguments are present, they are first converted to positional arguments, as follows. First, a list of unfilled slots is created for the formal parameters. If there are N positional arguments, they are placed in the first N slots. Next, for each keyword argument, the identifier is used to determine the corresponding slot (if the identifier is the same as the first formal parameter name, the first slot is used, and so on). If the slot is already filled, a :exc:`TypeError` exception is raised. Otherwise, the value of the argument is placed in the slot, filling it (even if the expression is ``None``, it fills the slot). When all arguments have been processed, the slots that are still unfilled are filled with the corresponding default value from the function definition. (Default values are calculated, once, when the function is defined; thus, a mutable object such as a list or dictionary used as default value will be shared by all calls that don't specify an argument value for the corresponding slot; this should usually be avoided.) If there are any unfilled slots for which no default value is specified, a :exc:`TypeError` exception is raised. Otherwise, the list of filled slots is used as the argument list for the call.
ru: Если даны именованные аргументы, то они сначала преобразуются в позиционные следующим образом. Сначала для “формальных” параметров создаётся список незаполненных мест. Если дано *N* позиционных аргументов, то они помещаются в *N* первых из этих мест. Далее для каждого именованного аргумента определяется, каким по счёту он идёт в формальных параметрах определения функции – и в такое же по счёту место помещается его значение (даже если это значение ««:const:`None`»» ) . Если это место оказывается уже́ занятым, то вызывается исключение «:exc:`TypeError`» . Когда все аргументы обработаны – места, оставшиеся необработанными заполняются соответствующими значениями по-умолчанию из определения функции. (Значения по-умолчанию вычисляются один раз – когда выполняется определение функции – таким образом, изменяемый объект, например список или словарь, использованный как значение по-умолчанию, будет сохраняться между вызовами функции, и его предыдущее значение будет доступно, если в него не будет передано значение в соответствующем аргументе при вызове. ) Если останутся незаполненными места, для которых нет значений по-умолчанию, то вызывается исключение «:exc:`TypeError`» . Заполненный таким образом список используется как список аргументов функции.
